In [4]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df = pd.DataFrame(['python','numpy','pandas'])
df

        0
0  python
1   numpy
2  pandas

In [7]:
df = pd.DataFrame({'id':[101,102,103],'department':['b.sc','m.sc','mcs']})
df

    id department
0  101       b.sc
1  102       m.sc
2  103        mcs

In [13]:
#append
d1 = pd.DataFrame({'x':[12,23,21,23],
                  'y':[34,5,42,3]})
d2 = pd.DataFrame({'x':[12,23,21,23],
                  'y':[34,5,42,3]})

d1.append(d2,ignore_index=True)

    x   y
0  12  34
1  23   5
2  21  42
3  23   3
4  12  34
5  23   5
6  21  42
7  23   3

In [31]:
#apply
import numpy as np
info = pd.DataFrame([[16,4]]*3, columns=['P', 'Q'])  
info.apply(np.sqrt)

     P    Q
0  4.0  2.0
1  4.0  2.0
2  4.0  2.0

In [25]:
#aggregate min,max,sum
info=pd.DataFrame([[1,5,7],[10,12,15],[18,21,24]],columns=['X','Y','Z']) 
info.agg(['sum','min','max'])

      X   Y   Z
sum  29  38  46
min   1   5   7
max  18  21  24

In [35]:
#assign
# Create an empty dataframe  
info = pd.DataFrame()  
  
# Create a column  
info['ID'] = [101, 102, 103]  
  
# View the dataframe  
info  
# Assign a new column to dataframe called 'age'   
info.assign(Name = ['Smith', 'Parker', 'John'],city=['pune','nashik','mumbai'])

    ID    Name    city
0  101   Smith    pune
1  102  Parker  nashik
2  103    John  mumbai

In [41]:
a = {'col1': [1, 2], 'col2': [3, 4]}  
info = pd.DataFrame(data=a)  
info.dtypes  
info.astype('float').dtypes

col1    float64
col2    float64
dtype: object

In [44]:
#count
info = pd.DataFrame({"Person":["Parker", "Smith", "William", "John"],  "Age": [27., 29, np.nan, np.nan] }) 
info.count()

Person    4
Age       2
dtype: int64

In [45]:
#describe
a1 = pd.Series([1, 2, 3])  
a1.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

In [49]:
#drop_duplicate
emp = {"Name": ["Parker", "Smith", "William", "Parker","Smith"],  
"Age": [21, 32, 29, 21,32]}  
info = pd.DataFrame(emp)  
info = info.drop_duplicates()  
print(info)

      Name  Age
0   Parker   21
1    Smith   32
2  William   29

In [9]:
#head and tail
import pandas as pd
df = pd.DataFrame({'id':[101,102,103],'department':['b.sc','m.sc','mcs']})
data = df.head(2)
data

    id department
0  101       b.sc
1  102       m.sc

In [8]:
data1 = df.tail(2)
data1

    id department
1  102       m.sc
2  103        mcs

In [17]:
#join
import pandas as pd
data3 =pd.DataFrame({'msg':["This is numpy"]})
data2 =pd.DataFrame({'key':["This is pandas"]})
data2.join(data3)

              key            msg
0  This is pandas  This is numpy

In [19]:
i = pd.DataFrame({"A":[8, 2, 7, 12, 6],   
                   "B":[26, 19, 7, 5, 9],    
                   "C":[10, 11, 15, 4, 3],   
                   "D":[16, 24, 14, 22, 1]}) 
i.mean(axis = 0)

A     7.0
B    13.2
C     8.6
D    15.4
dtype: float64

In [21]:
left = pd.DataFrame({  
   'id':[1,2,3,4,5],  
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],  
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})  
right = pd.DataFrame({  
    'id':[1,2,3,4,5],  
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],  
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})  
print(pd.merge(left,right,on='id') )

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5